a = input("Введите первый цвет: ")
b = input("Введите второй цвет: ")

if (a == "красный" and b == "синий") or (a == "синий" and b == "красный"):
    print(f"Получился: фиолетовый")

elif (a == "красный" and b == "желтый") or (a == "желтый" and b == "красный"):
    print(f"Получился: оранжевый")

elif (a == "синий" and b == "желтый") or (a == "желтый" and b == "синий"):
    print(f"Получился: зеленый")

elif (a == "желтый" and b == "зеленый") or (a == "зеленый" and b == "желтый"):
    print(f"Получился: лаймовый")

elif (a == "синий" and b == "зеленый") or (a == "зеленый" and b == "синий"):
    print(f"Получился: бирюзовый")

elif (a == "синий" and b == "фиолетовый") or (a == "фиолетовый" and b == "синий"):
    print(f"Получился: темно-синий")

elif (a == "красный" and b == "фиолетовый") or (a == "фиолетовый" and b == "красный"):
    print(f"Получился: малиновый")

elif (a == "красный" and b == "оранжевый") or (a == "оранжевый" and b == "красный"):
    print(f"Получился: красно-оранжевый")

elif (a == "желтый" and b == "оранжевый") or (a == "оранжевый" and b == "желтый"):
    print(f"Получился: золотистый")

else:
    print(f"Ошибка: такое смешивание не предусмотрено")