n = int(input())                                   # вводим число n
k = 0                                              # счётчик подходящих чисел, пока 0
for i in range(1, n + 1):                          # перебираем числа от 1 до n включительно
    if i % 2 != 0 and i % 3 != 0 and i % 5 != 0:   # если число не делится ни на 2, ни на 3, ни на 5
        k = k + 1                                  # увеличиваем счётчик на 1
print(k)                                           # выводим, сколько таких чисел нашли