# Слова из кроссворда
word1 = "дипфейк"
word2 = "алгоритм"
word3 = "нейросеть"
word4 = "модель"
word5 = "перевод"
word6 = "бот"

# Буквы из оранжевых клеток (записываем вручную)
letter1 = "п"   # 3-я буква слова "дипфейк"
letter2 = "р"   # 5-я буква слова "алгоритм"
letter3 = "о"   # 5-я буква слова "нейросеть"
letter4 = "м"   # 1-я буква слова "модель"
letter5 = "п"   # 1-я буква слова "перевод"
letter6 = "т"   # 3-я буква слова "бот"

# Собираем ключевое слово
key_word = letter1 + letter2 + letter3 + letter4 + letter5 + letter6

print("Слова:", word1, word2, word3, word4, word5, word6)
print("Ключевое слово:", key_word)